translations = {
    'az': {
        '<b>Приветствую тебя, мой друг!</b> Я бот, созданный для того, чтобы <i>облегчить твою жизнь и сделать ее более продуктивной</i>. \n\nС моими возможностями ты можешь ознакомиться команду - /help': '<b>Salam!</b> Həyatınızı <i>asanlaşdırmaq və daha məhsuldar</i> etmək üçün hazırlanmış bir botam.\n\nImkanlarımla tanış olmaq üçün - /help',
        '<b><i>Вы успешно сменили язык!</i></b>': '<b><i>Siz dili uğurla dəyişdiniz!</i></b>',
        'Сменить язык': 'Dil dəyışmək',

        '<b><i>Используйте команды ниже для получения подробной информации:</i></b>\n\n/help_all - Все основные функции\n/help_group - Весь функционал для групп\n/help_uni - Весь функционал связанные с платформами университетов\n\nВ случае проблем, багов, ошибок, вопросов, предложений, писать сюда - @papayyg': '<b><i>Ətraflı məlumat üçün aşağıdakı əmrlərdən istifadə edin:</i></b>\n\n/help_all - Bütün əsas funksiyalar\n/help_group - Bütün qrup funksionallığı\n/help_uni - Bütün universitetnən bağlı funksiyalar\n\nProblemlər, baq, səhvlər, suallar, təkliflər olduqu zaman bura yazın - @papayyg',

        'Купить билет 🎟': 'Bileti əldə etmək 🎟',
        'Закрыть': 'Bağlamaq',
        'Фото и музыку': 'Şəkil və musiqi',
        'Рендер видео': 'Fotolardan video hazırlamaq',
        'Следующая': 'Növbəti',
        'Предыдущая': 'Əvvəlki',
        '📎 Файлы предмета': '📎 Fənnin faylları',

        'Бесспорно': 'Ba bunun üçün olacaq',
        'Предрешено': 'Qabaqcadan məlum olub',
        'Никаких сомнений': 'Heç bir şübhə olmadan',
        'Определённо да': 'Mütləq bəli',
        'Можешь быть уверен в этом': 'Buna əmin ola bilərsiniz',
        'Мне кажется - да': 'Mənim fikrimcə - bəli',
        'Вероятнее всего': 'Çox güman ki',
        'Хорошие перспективы': 'Yaxşı perspektivlər var',
        'Знаки говорят - да': 'İşarələr deyir - bəli',
        'Да': 'Bəli',
        'Пока неясно, попробуй снова': 'Hələki aydın deyil, yenidən cəhd edin',
        'Спроси позже': 'Sonra soruş',
        'Лучше не рассказывать': 'Deməmək daha yaxşıdır',
        'Сейчас нельзя предсказать': 'İndi proqnozlaşdırmaq mümkün deyil',
        'Сконцентрируйся и спроси опять': 'Fikrivi topla və yenidən soruş',
        'Даже не думай': 'Heç düşünmə',
        'Мой ответ - нет': 'Mənim cavabım - yox',
        'По моим данным - нет': 'Mənim məlumatlarıma görə - yox',
        'Перспективы не очень хорошие': 'Perspektivlər çox yaxşı deyil',
        'Весьма сомнительно': 'Şübhəlidir',

        # 'Введите название города правильно (Через пробел)'
        # "Ясно \U00002600"
        # "Облачно \U00002601"
        # "Дождь \U00002614"
        # "Гроза \U000026A1"
        # "Снег \U0001F328"
        # "Туман \U0001F32B"
        # 'Посмотри в окно'
        # '\U0001F570 <b><i>{now}</i></b>\n<b>Погода в</b> <i>{city}</i>\n<b>Температура:</b> <i>{real_temp}C° <b>{wd}</b></i>\n\U0001F321 <b>Ощущение:</b> <i>{feels_temp}C°</i>\n\U0001F4A7 <b>Влажность:</b> <i>{humidity}%</i> \n\U0001F4A8	<b>Скорость ветра:</b> <i>{wind} м/c</i>\n\U0001F305 <b>Рассвет:</b> <i>{sunrise}</i>\n\U0001F307 <b>Закат:</b> <i>{sunset}</i>\n\U0001F304 <b>Продолжительность дня:</b> <i>{length}</i>': '\U0001F570 <b><i>{now}</i></b>\n<b>aaaaaa в</b> <i>{city}</i>\n<b>Температура:</b> <i>{real_temp}C° <b>{wd}</b></i>\n\U0001F321 <b>Ощущение:</b> <i>{feels_temp}C°</i>\n\U0001F4A7 <b>Влажность:</b> <i>{humidity}%</i> \n\U0001F4A8	<b>Скорость ветра:</b> <i>{wind} м/c</i>\n\U0001F305 <b>Рассвет:</b> <i>{sunrise}</i>\n\U0001F307 <b>Закат:</b> <i>{sunset}</i>\n\U0001F304 <b>Продолжительность дня:</b> <i>{length}</i>'

        # 'Введите текст для перевода'

        '<b>Вы отправили слайд-шоу</b>. Как вы хотите скачать?': '<b>Slayd şousu göndərdiniz</b>. Necə yükləmək istəyirsiniz?',
        'Отправил запрос, ожидайте..': 'Sorğu göndərildi, gözləyin..',
        '<b>Ожидайте.</b> Процесс может занять много времени...': '<b>Lütfən gözləyin.</b> Proses uzun müddət çəkə bilər...',

        'Отправьте команду ответом на фото/стикер/текстовое сообщение': 'Foto/stiker/mətn mesajına cavab verməklə əmr göndərin',
        'Сообщение слишком длинное': 'Mesaj çox uzundur',
        'Работает только с текстом, фото и стикером': 'Yalnız mətn, şəkil və stikerlə işləyir',
        'Стикер успешно удален': 'Stiker uğurla silindi',

        "Напишите сообщение ответом на видео": 'Videoya cavab olaraq mesaj yazın',

        'Ожидайте запроса, может занять до <i>30 секунд</i>.': 'Sorğunu gözləyin, <i>30 saniyə</i> çəkə bilər.',
        '⚠️ Ошибка. Повторите еще раз.': '⚠️ Xəta. Yenidən təkrarlayın.',
        'Страница {page_num} из {pages}:\n\n{page}': '{pages} səhifədən {page_num} səhifə:\n\n{page}',
        '<i><b>{title} ({year})</b></i>\n<b>В кинотеатре:</b> <i>{date}</i>\n<b>Страна:</b> <i>{country}</i>\n<b>Форматы:</b> {temp}<i>{type}</i>\n🧩 <b>Жанр:</b> <i>{genre}</i>\n\U0001F3A5 <b>Режиссер:</b> <i>{director}</i>\n\U0001F64D <b>В ролях:</b> <i>{cast}</i>\n\U0001F39E <b>Длительность:</b> <i>{duration}</i>\n\U0001F51E <b>Возрастные ограничения:</b> <i>{age}</i>': '<i><b>{title} ({year})</b></i>\n<b>Kinoteatrda:</b> <i>{date}</i>\n<b>Ölkə:</b> <i>{country}</i>\n<b>Formatlar:</b> {temp}<i>{type}</i>\n🧩 <b>Janr:</b> <i>{genre}</i>\n\U0001F3A5 <b>Rejissor:</b> <i>{director}</i>\n\U0001F64D <b>Rollarda:</b> <i>{cast}</i>\n\U0001F39E <b>Müddət:</b> <i>{duration}</i>\n\U0001F51E <b>Yaş məhdudiyyətləri:</b> <i>{age}</i>',
        "Страна:": 'Olkə:',
        "Год": 'Il',
        "Режиссер": 'Rejissor',
        "Жанр": 'Janr',
        "В ролях": 'Rollarda',
        "Длительность": 'Surəklilik',

        'Отправил запрос, ожидайте': 'Sorğu göndərdim, gözləyin',
        'Напишите ответом на фото': 'Şəkilə cavab verin',
        
        'Некорректная ссылка': 'Səhv link',

        'Отправьте ссылку через пробел после команды или ответом на ссылку': 'Əmrdən sonra boşluq qoyub və ya linkə cavab olaraq göndərin',

        # 'Обрабатываю ваш запрос'
        # '<i>Сервер недоступен.</i> Попробуйте другую модель.'
        # 'Запрос добавлен в очередь на {queue_size} месте'
        # '<i>Сервер был успешно изменен!</i>'

        'Пользователь закрыл сообщение': 'İstifadəçi mesajı bağladı',

        # 'Напишите выражение'
        # "⚠️ Ошибка: <i>Использовано неверное выражение</i>"

        'Нет': 'Yox',
        # 'Введите через пробел два значения'
        # 'Неправильное значение'
        # 'Орёл'
        # 'Решка'

        # 'Не флудите!': 

        'Начало работы': 'Başlanğıc',
        'Узнать подробности возможностей бота': 'Bot imkanlarının təfərrüatlarını öyrənin',
        'Сохранить данные в базе (Unibook, Empro)': 'Qeydiyyat məlumatları yadda saxla (Unibook, Empro)',
        'Удалить данные из базы (Unibook, Empro)': 'Yadda saxlanan məlumatları silir (Unibook, Empro)',
        'Посмотреть все свои НБ (Unibook, Empro)': 'Fənlər üzrə qayıblərə baxın (Unibook, Empro)',
        'Баллы по всем предметам (Unibook, Empro)': 'Bütün fənlər üzrə ballar (Unibook, Empro)',
        'Информация о всех предметах (Unibook)': 'Bütün fənnlər haqqında məlumat (Unibook)',
        'Средний балл за все семестры  (Unibook)': 'Bütün semestrlər üçün orta bal (Unibook)',
        'Подробный средний балл (Unibook)': 'Ətraflı GPA (Unibook)',
        'Кинопремьеры в CinemaPlus': 'CinemaPlus-da film premyeraları',
        'Кинопремьеры в ParkCinema': "ParkCinema-da filmin premyeraları",
        'Погода в указанном городе': 'Yazılmış şəhərdə hava',
        'Добавить фото/стикер/сообщение в набор чата': 'Söhbət dəstinə foto/stiker/mesaj əlavə edin',
        'Удалить стикер из набора': 'Stikeri setdən çıxarın',
        'Да или нет': 'Bəli və ya yox',
        'Случайное число от * до *': '*-dan *-ə qədər təsadüfi nömrə',
        'Выбор случайного варианта': 'Təsadüfi bir seçim',
        'Текст в речь': 'Mətndən nitqə',
        'Перевести текст на русский или английский': 'Mətni rus və ya ingilis dilinə tərcümə edin',
        'Перевод с любого на указанный': 'Hər hansı birindən təyin edilmişə köçürmə',
        'Подбросить монетку': 'Qəpik at',
        'Калькулятор': 'Kalkulyator',
        'Вырезать звук из видео': 'Videodan səsi kəsin',
        'Распознать музыку': 'Musiqinin adini tapmaq',
        'Сгенерировать изображение используя realisticVision': 'RealisticVision istifadə edərək şəkil yaradın',
        'Сгенерировать изображение используя dreamShaper': 'Dreamshaper istifadə edərək şəkil yaradın',
        'Создать вариации фотографии': 'Fotoqrafiya varyasyonları yaradın',
        'Сократить ссылку': 'Linki qısaldın',
        'Посмотреть состояние серверов': 'Serverlərin vəziyyətinə baxın',
        'Стать участником группы': 'Qrup üzvü ol',
        'Перестать быть участником группы': 'Qrupun üzvü olmağı dayandırın',
        'Отметить всех участников группы': 'Bütün qrup üzvlərini işarələyin',
        'Посмотреть статистику ежедневного конкурса': 'Gündəlik müsabiqə statistikasına baxın',
        'Включить ежедневный конкурс': 'Gündəlik müsabiqəni aktivləşdir',
        'Замутить пользователя': 'İstifadəçini susdur',
        'Размутить пользователя': 'İstifadəçinin səsini aç',
        'Исключить пользователя': 'İstifadəçini xaric et',
        'Забанить пользователя': 'İstifadəçini qadağan et',
        'Разбанить пользователя': 'İstifadəçini qadağadan çıxar',
        'Удалить все сообщения до указанного': 'Göstərilən mesaja qədər bütün mesajları silin',
        # 'Отправить рассылку':,
        # 'Начать конкурс':,
        # 'Посмотреть содержимое temp':,
        # 'Удалить содержимое temp':,
        # 'Указать сервер для Dream':,
        # 'Указать сервер для Real':,
        # 'Просмотр статистики':,
        'Отправляю запрос, ожидайте...': 'Sorğu göndərilir, gözləyin...',
        'Страница {page_num} из {output_pages}:\n\n{page}': '{output_pages} səhifədən {page_num} səhifə:\n\n{page}',
        '<b>Все предметы:</b>\n\n': '<b>Bütün fənnlər:</b>\n\n',
        '<b>Вы уже в базе!</b> Используйте /del, чтобы удалить данные из базы.': '<b>Siz artıq bazadasınız!</b> Məlumatları silmək üçün /del istifadə edin.',
        'Вы начали процесс сохранения логина и пароля. Укажите универ:': 'Login və parolunuzu saxlamaq prosesinə başlamışsınız. Uni qeyd edin:',
        '<b>Введите логин от платформы указанного университета</b>:': '<b>Göstərilən universitetin platformasından loginizi daxil edin</b>:',
        '<b>Теперь введите пароль:</b>': '<b>İndi parolu daxil edin:</b>',
        'Проверяю данные...': 'Məlumat yoxlanılır...',
        '<b><i>Авторизация прошла успешно!</i></b> Все функции доступны.': '<b><i>Avtorizasiya uğurlu oldu!</i></b> Bütün funksiyalar mövcuddur.',
        '<b><i>Данные введены неверно!</i></b> Повторите попытку.': '<b><i>Yanlış data daxil edilib!</i></b> Lütfən, yenidən cəhd edin.',
        '<b>Вы успешно удалены из базы!</b>': '<b>Bazadan uğurla silindiniz!</b>',
        '<b>Вас нет в базе!</b> Используйте /auth, чтобы авторизоваться.': '<b>Siz verilənlər bazasında deyilsiniz!</b> Daxil olmaq üçün /auth istifadə edin.',
        'Ошибка подключения. Повторите попытку': 'Əlaqə xətası. Yenidən cəhd elə',
        'Отправляю запрос, этой займет немало времени, ожидайте...': 'Sorğu göndərirəm, bu çox vaxt aparacaq, gözləyin...',
        'К сожалению на данный момент функция не доступна для вас.':'Təəssüf ki, bu funksiya hazırda sizin üçün əlçatan deyil.',
        '<b>Поздравляю!</b> У вас нет предметов.': '<b>Təbrik edirik!</b> Heç bir elementiniz yoxdur.',
        "🔙 Назад": "🔙 Geri",
        '📝 Выберите нужный файл, чтобы скачать:': '📝 Yükləmək üçün istədiyiniz faylı seçin:',
        'Файл пустой!': "Fayl boşdur!",
        '✅ <b><i>Средний балл за семестр: {sredniy} ({sem_point} {sem_credit})</i></b>\n\n':'✅ <b><i>Semestr ortalaması: {sredniy} ({sem_point} {sem_credit})</i></b>\n\n',
        '🎓\nИтоговый средний балл: {sredniy}\nСумма баллов: {total}\nСумма кредитов: {summary_credit}': '🎓\nÜmumi orta xal: {sredniy}\nÜmumi xal: {total}\nÜmumi kreditlər: {summary_credit}',
        '🎓\nИтоговый средний балл: {sredniy}\nСумма баллов: {total}\nСумма кредитов: {summary_credit}\n\nСредний балл без учета проблемных: {sredniy_p}\nСумма баллов: {temp_total}\nСумма кредитов: {temp_credit}': '🎓\nÜmumi orta xal: {sredniy}\nÜmumi xal: {total}\nÜmumi kreditlər: {summary_credit}\n\nProblemsiz orta xal: {sredniy_p}\nÜmumi xal: {temp_total}\nÜmumi kreditlər: {temp_credit} ',
        'Cамостоятельная работа: <i>{mark}</i>\n': 'Sərbəst iş: <i>{mark}</i>\n',
        'Презентация: <i>{mark}</i>\n': 'Təqdimat: <i>{mark}</i>\n',
        'Курсовая работа: <i>{mark}</i>\n': 'Kurs işi: <i>{mark}</i>\n',
        'Лабораторная: <i>{mark}</i>\n': 'Lab. işi: <i>{mark}</i>\n',
        'Квиз: <i>{mark}</i>\n': 'Quiz: <i>{mark}</i>\n',
        'Мидтерм: <i>{mark}</i>\n': 'Midterm: <i>{mark}</i>\n',
        'Еще не был': 'Hələ yox',
        'После экзамена': 'İmtahandan sonra',
        'Балл до экзамена: <i>{mark_9}</i>\nЭкзамен: <i>{mark_10}</i>\nИтоговый балл (Буква): <i>{mark_11} {mark_12}</i>\nНБ: <i>{mark_1}%</i>\n': 
        'İmtahandan əvvəl xal: <i>{mark_9}</i>\nİmtahan: <i>{mark_10}</i>\nYekun bal (Hərf): <i>{mark_11} {mark_12}</i>\nQayıb: <i>{mark_1}%</i>\n',
        '<b>{hours}</b> (Лекции: <b>{m_hours}</b>': '<b>{hours}</b> (Mühazirələr: <b>{m_hours}</b>',
        ', Семинары: <b>{s_hours}</b>': ', Seminarlar: <b>{s_hours}</b>',
        ', Лабораторные: <b>{l_hours}</b>': ', Laboratoriya: <b>{l_hours}</b>',
        'Экзамен (<b>{mark}</b>)': 'İmtahan (<b>{mark}</b>)',
        ', Курсовая (<b>{mark}</b>)': 'Kurs işi (<b>{mark}</b>)',
        ', Лабораторные (<b>{mark}</b>)': ', Lab. işi (<b>{mark}</b>)',
        ', Презентация (<b>{mark}</b>)': ', Təqdimat (<b>{mark}</b>)',
        ', Самостоятельные (<b>{mark}</b>)': ', Sərbəst iş (<b>{mark}</b>)',
        '(Лек.)': '(Müh.)',
        '(Сем.)': '(Məş.)',
        '(Лаб.)': '(Lab.)',
        '(Лек. и Сем.)': '(Müh. və Məş.)',
        '(Сем. и Лаб.)': '(Məş. və Lab.)',
        '(Лек. и Лаб.)': '(Müh. və Lab.)',
        '(Лек., Сем. и Лаб.)': '(Müh., Məş. və Lab.)',
        '2 (Если что-то не так на видео в 1)': '2 (1-dəki videoda səhv olarsa)',
        '{student_name}\n<b><i>{subj_title}</i></b>\n💸 Количество кредитов: <i>{credit}</i>\n⏳ Общие часы: <i>{hours})</i>\n✅ Тип оценки: <i>{points}</i>\n👨‍🏫 Преподаватели: <i>{professor}</i>': '{student_name}\n<b><i>{subj_title}</i></b>\n💸 Kreditlərin sayı: <i>{credit}</i>\n⏳ Ümumi saatlar: <i>{hours})</i>\n✅ Qiymət növü: <i>{points}</i>\n👨‍🏫 Müəllimlər: <i>{professor}</i>',
        '📚 <b><i>{subj_title}</i></b>\n<i>ФИ: Курс. | Самост. | През. | Лаб. | Квиз | Мид.</i>\n': '📚 <b><i>{subj_title}</i></b>\n<i>SA: Kurs. | Sərb. | Təq. | Lab. | Quiz | Mid.</i>\n'
    }
}

async def _(text, lang='ru'):
    if lang == 'ru':
        return text
    else:
        global translations
        try:
            return translations[lang][text]
        except:
            return text
